{ "articles" : [
{ "url" : "http://www.ajc.com/news/atlanta/dj-faces-murder-charge-1339098.html",
  "title" : "DJ faces murder charge in nightclub shooting",
  "text" : "A Fulton County judge ruled Wednesday that a deejay should face felony murder and other charges in the shooting death of a nightclub customer, Channel 2 Action News reported. Johnny Jackson III, who goes by the stage name \"DJ Outlaw,\" is accused of firing a shotgun at Mark Williams last month, killing him in the parking lot of Rockafella's Nightclub on Old National Highway in south Fulton County. Jackson's defense attorney said his client acted in self-defense. Police and prosecutors disputed that. \"The victim was shot five times with a shotgun,\" Fulton County police Detective J.S. Rittberg said. One witness, Rittberg said, told police that she saw Jackson \"fire a couple of times and then stand over the victim and fire more.\" The incident occurred the night of Jan. 16. Williams allegedly attacked Jackson in the club for not playing his CD and was told to leave. Later, the deejay said he was outside walking to his truck when he saw Williams approaching with a gun in his hand. Morris Fair, Jackson's defense attorney, argued that Jackson fired his own weapon in self-defense. \"You have an absolute right to defend yourself if you feel you're being threatened. And you have the right to use force -- deadly force if necessary,\" Fair said. But police and prosecutors said witnesses told them they did not see Williams with a gun. Nor was a weapon found on the man's body, they said. \"No one has stated, aside from Mr. Jackson, that the victim had a weapon,\" Rittberg said. Judge Karen Woodson found there was probable cause to send the case to a grand jury. Besides felony murder, Jackson faces charges of aggravated assault and possession of a firearm by a convicted felon." },
{ "url" : "http://www.wsbtv.com/news/news/local/dj-argues-he-killed-man-outside-nightclub-self-def/nHX2q/",
  "title" : "DJ argues he killed man outside nightclub in self-defense",
  "text" : "ATLANTA — A nightclub DJ charged with murder says he shot the victim in self-defense, but prosecutors say the evidence doesn't show the life of Johnny Jackson III was in danger. Jackson faces charges of felony murder, aggravated assault, possession of a firearm during the commission of a felony and possession of a firearm by a convicted felon. Prosecutors say he shot and killed Mark Williams at Rockafella's Nightclub on Old National Highway on Jan. 16. During a preliminary hearing, Fulton County police Detective J.S. Rittberg testified that Jackson was a DJ at the private club. He said he went by the name DJ Outlaw. The night of the incident, the detective says, Williams, a former Rockafella's employee, went into the DJ booth and assaulted Jackson because he wouldn't play his CD. Williams was ordered to leave. Rittberg says Williams went out one door and Jackson went out another. The detective says Jackson told him that he saw Williams coming at him in the parking lot while he was near his truck. Testimony indicated that someone had given Jackson a shotgun and he opened fire on Williams after Jackson says he saw Williams beginning to point a gun at him. \"The victim was shot five times with a shotgun,\" Rittberg testified. Jackson's attorney says his client shot because he feared for his life. \"You have an absolute right to defend yourself if you feel you're being threatened. And you have the right to use force -- deadly force -- if necessary,\" defense attorney Morris Fair Jr. said.  \"In my client's mind, this guy is fixing to jump on me again and he's got a gun this time.\" Prosecutors say there's one problem with that theory. \"No one has stated, aside from Mr. Jackson, that the victim had a weapon,\" Rittberg said. Police say no weapon was found on the victim. Police also say witnesses told them Jackson kept firing at the victim, even when he was on the ground. \"She (a witness) saw him fire a couple of times and then stand over the victim and fire more,\" Rittberg said. Police say Williams was hit twice in the back, two times in the torso and once in the head. As for the gun Jackson says Williams had, Fair said police haven't talked to all the witnesses. \"I know people have seen that man with a gun,\" Fair said. Judge Karen Woodson found enough evidence, or probable cause, to move the case forward. It will now go to a grand jury." }
]}
