{ "articles" : [
{ "url" : "http://www.guardian.co.uk/technology/2012/feb/16/cisco-appeals-against-microsoft-buying-skype",
  "text" : "Cisco launches appeal against Microsoft's £5.4bn deal to buy Skype Cisco asks European commission to ensure Skype's 700 million users are not locked into a Microsoft platform Cisco has launched an appeal against Microsoft's $8.5bn (£5.4bn) acquisition of internet phone service Skype on the grounds that the deal could prevent video calls becoming as popular as voice calls. The move could threaten Microsoft's largest ever takeover, which has already completed after being approved by American regulators last summer and by the EU four months ago.Cisco, an American multinational, says it does not wish to block the deal but wants European commission regulators to ensure Skype's 700 million customers are not locked into a Microsoft platform.Cisco uses open standards for its own video conferencing product and wants Skype to do the same.\"Our goal is to make video calling as easy and seamless as email is today,\" said Marthin De Beer, Cisco's video conferencing boss, announcing the appeal in a blog post on Wednesday evening.\"Making a video-to-video call should be as easy as dialling a phone number,\" he said.\"Today, however, you can't make seamless video calls from one platform to another, much to the frustration of consumers and business users alike.\"Both Microsoft and Skype use technologies that are not compatible with other video and calling services.Video calling applications, which also include Apple's FaceTime, are growing in popularity but their use has been held back because they cannot link with each other.Messagenet, a European internet phone service based in Italy, has joined Cisco in filing the appeal.Both companies had contributed during the commission's original consultation on the deal.\"The standards discussion is a legitimate one but that's not why this is going on,\" said Henry Dewing, an analyst at Forrester Research.The real focus was competition, he said, with Cisco trying to slow Microsoft's momentum.Skype was founded in 2003 in Estonia and acquired by online auction giant eBay in September 2005.It was sold to an investment group led by Silver Lake in November 2009 in a deal that valued the company at $2.75bn. Microsoft's biggest acquisition until Skype had been its 2007 swoop on digital marketing firm aQuantive for $6.3bn.Microsoft responded to the Cisco appeal by stating: \"The European commission conducted a thorough investigation of the acquisition, in which Cisco actively participated, and approved the deal in a 36-page decision without any conditions. We're confident the commission's decision will stand up on appeal.\""},
{ "url" : "http://www.pcworld.com/businesscenter/article/250087/microsoft_sees_skype_linking_all_its_products_cfo_says.html#tk.rss_smb",
  "text" : "Microsoft Sees Skype Linking All Its Products, CFO Says Microsoft will aggressively and broadly integrate Skype across its product portfolio, the company's CFO said on Wednesday, the same day that rival Cisco Systems raised concerns about Microsoft's Skype integration plans.Microsoft CFO Peter Klein, speaking at a conference, portrayed Skype--the ultra-popular IM, presence, video chat and IP telephony service--as a product that Microsoft will use to unify and extend both its consumer and enterprise portfolios.\"When you think about Skype and when you think about trying to deliver a compelling set of experiences across devices, the most fundamental experience across devices is communications,\" he said at the Goldman Sachs Technology & Internet Conference, which was webcast.\"Skype extends that across all of our assets, whether it's with Lync in the enterprise, or with Xbox Live. It's something that really ties together all of our devices, a scenario that's as universal as any,\" said Klein, who answered questions from a financial analyst and from audience members.Cisco's European AppealEarlier Wednesday, Cisco announced its intention to appeal the European Commission's approval of Microsoft's $8.5 billion Skype acquisition. Cisco wants the EC to require that Microsoft and Skype support standards for interoperability with other collaboration platforms.Cisco is specifically concerned about how Microsoft intends to tie Skype and Lync, an enterprise product that provides IM, presence, video conferencing, IP telephony and online meetings.Microsoft has said in the past that it intends to create a bridge between the two products, so that Lync users can communicate with Skype users, including business partners and customers.When Microsoft announced its Skype acquisition last May, CEO Steve Ballmer pledged to continue support for \"non-Microsoft devices.\"In a blog post Wednesday, Cisco said it plans to appeal the EC's decision at the General Court of the European Union and ask that conditions be imposed on Microsoft.Cisco wants Microsoft and Skype to support the open standards that other videoconferencing vendors support, because otherwise competition and innovation could be harmed.In a statement, Microsoft said: \"The European Commission conducted a thorough investigation of the acquisition, in which Cisco actively participated, and approved the deal in a 36-page decision without any conditions. We're confident the Commission's decision will stand up on appeal.\"At the Goldman Sachs event, Klein also said Skype plays a key role in Microsoft's strategy for cloud services. \"If you think about how the world is evolving and our approach to it, we think about it in terms of devices and services, and certainly a lot of the services are cloud services,\" he said.\"What's really exciting about Skype is that it's a really compelling and popular service people around the world use and are very engaged with. If you think about our approach to developing and delivering a set of really compelling experiences and services across a range of devices, Skype absolutely accelerates what we're doing there,\" Klein said.(Stephen Lawson in San Francisco contributed to this report.)Juan Carlos Perez covers search, social media, online advertising, e-commerce, web application development, enterprise cloud collaboration suites and general technology breaking news for The IDG News Service. Follow Juan on Twitter at @JuanCPerezIDG."},
{ "url" : "http://www.ibtimes.com/articles/299454/20120215/report-cisco-sues-revision-microsoft-skype-merger.htm",
  "text" : "Report: Cisco Sues for Revision on Microsoft-Skype Merger Networking specialist Cisco has decided to mount a challenge on Microsoft's takeover of Skype, lodging an appeal before the European Commission earlier this week.According to the Associated Press (AP), Cisco has expressly declared that it does not intend to block the merger, which cost Microsoft $US8.5 billion and approved by both the United States and European regulators in October last year.\"Cisco does not oppose the merger, but believes the European Commission should have placed conditions that would ensure greater standards-based interoperability,\" Cisco video conferencing chief Marthin De Beer was reported by AP saying in a blog post.That specific condition is for Microsoft to allow inter-connectivity between video calling services, which is currently dominated by Skype with its reported active users of some 170 million all over the world. Skype's video call service has also been recently made available through Facebook's social networking site, which in turn counts more than 750 million users.Cisco is mostly engaged in providing networking equipments but its video conferencing service has started picking up and with the prospects of wide corporate subscriptions, the business division has become a lucrative market for major players.Cisco has expressed serious concerns that once Microsoft has assumed full ownership of Skype, it will impose exclusivity on video calls within the Skype network and block inter-connectivity.There exists a tendency for Microsoft to \"seek to control the future of video communications\", De Beer wrote in his blog.\"Making a video-to-video call should be as easy as dialling a phone number ... Today, however, you can't make seamless video calls from one platform to another, much to the frustration of consumers and business users alike,\" De Beer said.On its filing, Cisco asked EU's General Court to review the Commission's decision on the Microsoft-Skype merger and consider the possibility of amending the original ruling and allow the inclusion of a provision that will require Microsoft to guarantee open standards for video calls and conferencing.A spokesman, however, for the Commission told AP that EU's earlier decision will be defended before the Court.Also, Microsoft said in a statement that it is confident that the earlier EU ruling will be sustained by its General Court.\"The European Commission conducted a thorough investigation of the acquisition, in which Cisco actively participated, and approved the deal in a 36-page decision without any conditions,\" the software giant was quoted by AP as saying in a statement. "},
{ "url" : "http://arstechnica.com/microsoft/news/2012/02/cisco-begs-eu-make-microsoft-open-up-skypes-users-to-cisco-hardware.ars?utm_source=rss&utm_medium=rss&utm_campaign=rss",
  "text" : "Cisco begs EU: make Microsoft open up Skype's users to Cisco hardware Cisco has appealed to the European Union's General Court, asking for the European Commission's approval of Microsoft's takeover of Skype to be made conditional. The network infrastructure company wants the EC to ensure \"standards-based interoperability in the video calling space.\"Regulatory bodies gave Microsoft's takeover of Skype the go-ahead last year, with the deal finalized in October. Cisco says that it does not want to block the merger entirely, just restrict it and require Microsoft to make Skype play nicely with other voice and video calling systems.Skype's video and voice chat protocol is entirely proprietary and undocumented. Skype also uses a range of different codecs (including the proprietary, Google-owned VP8 and the open H.264). This makes Skype's network of users almost completely isolated, and unable to communicate directly with any other VoIP or video system.Skype does have a product, Skype Connect, that can bridge between Skype and SIP-based telephony systems for voice communications, and at various times has offered facilities to bridge to other PBXes. But for the most part, it has no interoperability with any other voice or video systems.The same is broadly true of Microsoft's pre-Skype systems: Windows Live Messenger, and Lync. Though there are provisions to bridge Lync to SIP telephony systems, both Lync and Messenger are largely sealed systems.Skype is the most widely-used voice and video call system in the world, with users numbering in the hundreds of millions, and even more able to use Skype technology through the integration with Facebook. Messenger is similarly the most-used instant-messaging system, and Lync is growing fast.The lack of interoperability extends to Cisco's own voice and video telecoms system. Cisco's video conferencing systems are built around industry standard protocols: SIP, H.263, H.264, and others. The company has also worked towards the standardization and development of interoperable multivendor implementations of some of its value-added features, such as its Telepresence Interoperability Protocol (TIP).Cisco says that the different codecs used by the different Microsoft/Skype products is a particular problem. Differences in call setup can be handled relatively easily by simple bridge software. But different codecs require the bridge to also transcode the video, converting between formats, which increases complexity and hardware demands, and also compromises quality. A consistent set of codecs (with consistent bitrates and other quality parameters) would eliminate the need for this costly conversion.Cisco attempted to enter the consumer video calling market with its ill-fated ūmi line: $500 home video-conferencing systems that surprisingly failed to set the world alight. Lack of interoperability with the consumer space's most popular video calling system made ūmi a tough sell.Without the Microsoft takeover, Cisco would have had little ability to break into this market and compete with the heavily entrenched Skype. But with Microsoft purchasing Skype, Cisco has a rare opportunity to force legislative oversight and attach new conditions to the behavior of the combined entity. If the courts were sympathetic to Cisco's requests and demanded that Microsoft and Skype switch to using standard protocols in standard ways, Cisco's products would gain access to hundreds of millions of new users.This explains why Cisco is not arguing for the deal to be canceled outright: with the merger blocked, Microsoft and Skype would remain free to keep their systems proprietary, with no possibility of the imposition of conditions.The European Commission made its decision last year, but unlike the comparable Department of Justice decision, EC decisions can for a limited time be appealed. That appeal window will close soon.European Commission spokesman Antoine Colombani said that the Commission will defend its decision in court, and a Microsoft spokesperson said, \"The European Commission conducted a thorough investigation of the acquisition, in which Cisco actively participated, and approved the deal in a 36-page decision without any conditions. We're confident the Commission’s decision will stand up on appeal.\""}
  ]}
